[
  {
    "id": "rc_rank",
    "type": "vitamin",
    "vit_type": "counter",
    "name": { "str": "Rusted Chain Rank" },
    "min": 0,
    "max": 12,
    "rate": "0 h",
    "excess": "rc_rank",
    "flags": [ "NO_DISPLAY" ],
    "disease_excess": [ [ 1, 2 ], [ 3, 4 ], [ 5, 6 ], [ 7, 8 ], [ 9, 10 ], [ 11, 12 ] ]
  },
  {
    "type": "effect_type",
    "id": "rc_rank",
    "name": [ "Stray Mutt", "Rusted Mutt", "Rusted Hound", "Chained Hound", "Chained Wolf", "Unrestrained Wolf" ],
    "desc": [
      "The Rusted Chains know of you. In a good way. Some of their skills has rubbed off on you.",
      "You're part of the Rusted Chains, a basic member, and you'll make sure the world remembers it.",
      "You've made a name for yourself, most of the low-level Chains even give you begrudging respect.",
      "It's taken a while, but you've carved your spot into the Rusted Chains. They know you. You know them. They respect your name.",
      "Finally you have claimed your rightful place as a leader of the Rusted Chains, none of the underlings question you, as is right.",
      "The Chains are yours. The world will know the Wolves unrestrained."
    ],
    "apply_message": [
      [ "You feel your allegiance shift to the Rusted Chains.", "mixed" ],
      [ "You're theirs now, one of them.", "mixed" ],
      [ "You're starting to catch a glimmer of respect in some of your companion's eyes.", "mixed" ],
      [ "You had their respect before, now you know you have their belief.", "mixed" ],
      [ "The Rusted Chains are starting to show you subservience, you've grown past most of them.", "mixed" ],
      [ "The Chains bow their head in respect to you. You're their true leader now.", "mixed" ]
    ],
    "remove_message": "You've betrayed the Rusted Chains. Theirs no longer.",
    "max_intensity": 6,
    "effect_dur_scaling": [ { "effect_id": "bleed", "modifier": 0.95, "same_bp": false } ],
    "scaling_mods": { "pain_amount": [ -1 ], "pain_tick": [ 100 ] }
  },
  {
    "id": "kr_rank",
    "type": "vitamin",
    "vit_type": "counter",
    "name": { "str": "Kurokumo Rank" },
    "min": 0,
    "max": 12,
    "rate": "0 h",
    "excess": "kr_rank",
    "flags": [ "NO_DISPLAY" ],
    "disease_excess": [ [ 1, 2 ], [ 3, 4 ], [ 5, 6 ], [ 7, 8 ], [ 9, 10 ], [ 11, 12 ] ]
  },
  {
    "type": "effect_type",
    "id": "kr_rank",
    "name": [ "Lost Knife", "Dulled Blade", "Sharp Blade", "Blade Reforged", "Katana Born", "Eternal Blade" ],
    "desc": [
      "The Kurokumo have accepted you, at least in part.",
      "They accepted you before, but now the Kurokumo know you are one of theirs.",
      "You've made a name for yourself, beyond the rank and file, your skills are being recognised.",
      "It's more than just a name now, you have a title, you're starting to give more orders than you take.",
      "You've proven your place in the higher reaches of the Kurokumo, but you've began to see you're a small fish in a much larger pond.",
      "You take your place, on the top of the clan's pecking order. They are yours, and yet, you find there are those above you still. Just not in the clan."
    ],
    "apply_message": [
      [ "You feel your allegiance shift to the Kurokumo clan.", "mixed" ],
      [ "You're theirs now, just another sword.", "mixed" ],
      [ "You're starting to catch a glimmer of respect in some of your clan's eyes.", "mixed" ],
      [ "You had their respect before, now you know you have their belief.", "mixed" ],
      [ "The Kurokumo are starting to understand, the stronger raise to the top.", "mixed" ],
      [ "There is an awe to the other members whenever they look towards you.", "mixed" ]
    ],
    "remove_message": "You've betrayed the Kurokumo. You are theirs no longer.",
    "max_intensity": 6,
    "scaling_mods": { "speed_mod": [ 2 ] }
  },
  {
    "id": "fixer_rank",
    "type": "vitamin",
    "vit_type": "counter",
    "name": { "str": "Ficer Rank" },
    "min": 0,
    "max": 20,
    "rate": "0 h",
    "excess": "fixer_rank",
    "flags": [ "NO_DISPLAY" ],
    "disease_excess": [ [ 1, 2 ], [ 3, 4 ], [ 5, 6 ], [ 7, 8 ], [ 9, 10 ], [ 11, 12 ], [ 13, 14 ], [ 15, 16 ], [ 17, 18 ], [ 19, 20 ] ]
  },
  {
    "type": "effect_type",
    "id": "fixer_rank",
    "name": [ "Grade 9", "Grade 8", "Grade 7", "Grade 6", "Grade 5", "Grade 4", "Grade 3", "Grade 2", "Grade 1", "Colour" ],
    "desc": [
      "You've attained the base level of a fixer, the lowest rung, there's only up from here.",
      "You're now a respectable fixer, not one that stands out, but with enough strength to take on decent contracts.",
      "You've attained grade seven, and proven yourself a survivor and a fighter.",
      "At grade six, you are above most fixers, with a proven track record of success.",
      "You've achived grade five, and with it are considered skilled in your own right, capable of taking on threats beyond most humans.",
      "You're reaching the upper tiers of the fixer hierachy, a veteran that knows their stuff and their limits."
      "You've come to the understanding that limits can always be broken, to pave the way for growth.",
      "From here you can see the top, only a step away. Your skill is recognised, as is your impact in the organisation.",
      "You are one of the best, and stand shoulder to shoulder with the legends of the fixer world.",
      "You've gone above and beyond all expectations, and been rewarded with a colour of your very own. All now recognise you.",
    ],
    "apply_message": [
      [ "Your Fixer rank is increased.", "mixed" ]
    ],
    "remove_message": "You've been stripped of your fixer rank.",
    "max_intensity": 10,
    "scaling_mods": { "speed_mod": [ 1 ] }
  }
]